multiphaseInterFoam/waveSlopeOil/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.air 1
    volScalarFieldValue alpha.water 0
    volScalarFieldValue alpha.oil 0
);

regions
(
    boxToCell
    {
        box (-1.0 -1.0 -1.0) (10.0 1.0 0.25);
        fieldValues
        (
            volScalarFieldValue alpha.water 1
            volScalarFieldValue alpha.air 0
            volScalarFieldValue alpha.oil 0
        );
    }
    boxToCell
    {
        box (-1.0 -1.0 0.25) (10.0 1.0 0.30);
        fieldValues
        (
            volScalarFieldValue alpha.oil 1
            volScalarFieldValue alpha.air 0
            volScalarFieldValue alpha.water 0
        );
    }
);


// ************************************************************************* //
